{"meta":{"title":"Petingo","subtitle":null,"description":null,"author":"Petingo","url":"https://blog.petingo.ch"},"pages":[{"title":"","date":"2021-11-13T09:20:38.757Z","updated":"2021-11-13T09:20:38.757Z","comments":true,"path":"gallery/index.html","permalink":"https://blog.petingo.ch/gallery/index.html","excerpt":"","text":"","raw":null,"content":null},{"title":"","date":"2021-11-13T09:20:38.754Z","updated":"2021-11-13T09:20:38.754Z","comments":true,"path":"about/index.html","permalink":"https://blog.petingo.ch/about/index.html","excerpt":"","text":"關於我 花蓮人 興趣太多，能力太少 想做的事情很多，會做的事情不多，真正付諸實踐的事情很少 關於部落格 除了這篇自我介紹，想放的東西大概有這些： 技術相關的文章：會放上一些曠日費時才找到的資料，希望可以幫助到一些人。 一些想法：記錄一些突然冒出來的想法，大概是希望幾年後回來看的時候可以一邊點頭一邊自言自語「原來我那個時候是這樣想的啊！」 照片：\b\b）。 Icons made by Linh Pham & Dave Gandy & Chanut from flaticon is licensed by CC 3.0 BY","raw":null,"content":null},{"title":"CV","date":"2022-07-10T23:39:51.915Z","updated":"2022-07-10T23:39:51.915Z","comments":true,"path":"CV/index.html","permalink":"https://blog.petingo.ch/CV/index.html","excerpt":"","text":"Yang Hong-Bin Link to Portfolio hong-bin.yang@epfl.ch Lausanne, Switzerland Education École Polytechnique Fédérale de Lausanne M.S. in Computer Science Sep. 2021 ~ Present Taiwan Tech B.S. in Computer Science Sep. 2016 ~ Jun. 2020 GPA: 4.05/4.3, Rank: 3/70 Czech Technical University in Prague Exchange Student in Faculty of Electrical Engineering​ Feb. 2020 ~ Jun. 2020 GPA: 1.0/1.0 Professional Experience AiiULab (Artificial Intelligence and Image Understanding), Academia Sinica Research Assistant Jul. 2020 ~ Dec. 2020 Conduct research on deep learning-based image harmonization and image forgery detection. Lab of Image/Video Processing and Compression, Taiwan Tech Student Research Assistant Jan. 2019 ~ Feb. 2020 Conducted research on chroma subsampling and upsampling. Proposed a method on YUV420 subsampling, which outperform the previous state-of-the-art by &gt;1db in evaluation of color-PSNR. STAR BIT Innovation Co.,Ltd. Software Engineer Intern Mar. 2018 ~ Jul. 2019 Work on a team and built a decentralized cryptocurrency exchange. My main responsibility is developing APIs in JavaScript to connect different types of Ethereum wallets to the website. Collaborated with KeyXentic Inc. and developed a Chrome Extension, which enables their hardware cryptocurrency wallet to access web services directly through Web3. Publication Chung, K. L., Cheng, J. S., &amp; Yang, H. B. (2020). Effective Chroma Subsampling and Luma Modification for RGB Full-Color Images Using the Multiple Linear Regression Technique. IEEE Access, 8, 118315-118323. (Link to Paper) I proposed the initial idea of applying multiple linear regression on this task and tested some existing methods which we listed for comparison in the paper. Honors &amp; Awards 2021 | Special Award – Shin Kong Mitsukoshi International Photography Contest 2020 | Study Abroad Scholarship, Taiwan Tech and Ministry of Education, Taiwan Based on English proficiency and academic performance 2019 | College Student Research Scholarship, Ministry of Science and Technology, Taiwan Based on research proposal and academic performance Proposed a CNN-based chroma upsampling method for light field image 2019 | Silver Award – ICPC Taiwan National Contest for Technology Universities Preliminary for ACM International Collegiate Programming Contest (ACM-ICPC) 2018 | 1st Place – National Taiwan University System App Innovation Contest Interscholastic competition in between National Taiwan University System Proposed a map-based student forum I developed the client-side Android App 2018 | Honorable mention – National Collegiate Programming Contest (Taiwan) Preliminary for ACM International Collegiate Programming Contest (ACM-ICPC) 2017 | Best Presentation Award – Intelligent Living Hackathon Top 6 among 50 teams Proposed a management system for a shared refrigerator in a dormitory I develop an App which is used for read student-id and scan barcodes on food packaging h1{ color: #143e69; } h2{ color: #143e69; margin-top: 1em; margin-bottom: 0.3em; } .post-content h3{ font-size: 17px; margin-top: 0.5em; margin-bottom: 0px; } p{ margin: 0px; } ul{ margin-top: 0px; margin-bottom: 0.2em; } .mini-space { padding-top: 0.1em }","raw":null,"content":null}],"posts":[{"title":"Geometric Computing","slug":"Geometric-Computing","date":"2022-02-13T16:39:23.000Z","updated":"2022-07-10T23:10:33.115Z","comments":true,"path":"Geometric-Computing/","link":"","permalink":"https://blog.petingo.ch/Geometric-Computing/","excerpt":"\nMark Pauly 教授跟 Geometric Computing 應該算是我想來 EPFL 的原因之一。\n我總覺得 Geometric Computing 是電腦圖學的反義詞；圖學用電腦創造虛擬的世界，Geometric Computing 則在模擬真正的現實。","text":"Mark Pauly 教授跟 Geometric Computing 應該算是我想來 EPFL 的原因之一。 我總覺得 Geometric Computing 是電腦圖學的反義詞；圖學用電腦創造虛擬的世界，Geometric Computing 則在模擬真正的現實。 3.4.2 Gradient Descent with Backtracking line-search Dinasour Parameter w = 10, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.01 Result hit tolerance @ iter #17110 with energy 1.36E-4 Objective function trend chart Dance Parameter w = 7, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.01 Result hit tolerance @ iter #29392 with energy 9.95E-5 Objective function trend chart Gym Parameter w = 10, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.02 Result hit tolerance @ iter #35012 with energy 3.11E-5 Objective function trend chart 3.4.3 BFGS Dinasour Parameter w = 10, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.02 Result hit tolerance @ iter #337 with energy 1.31E-4 Objective function trend chart Dance Parameter w = 13, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.02 Result hit tolerance @ iter #494 with energy 2.01E-5 Objective function trend chart Gym Parameter w = 10, obj_tol = 1E-10, theta = 1.0, beta = 0.5, c = 0.02 Result hit tolerance @ iter #460 with energy 2.75E-5 Objective function trend chart 3.4.4 My Shape Cat Parameter w = 44, obj_tol = 1E-10, theta = 0.1, beta = 0.5, c = 0.02 Result hit tolerance @ iter #1433 with energy 1E-3 Objective function trend chart Wu-Jing (Turnip-Head) Parameter w = 9, obj_tol = 1e-10, theta = 0.1, beta = 0.5, c = 0.01 Result hit tolerance @ iter #1625 with energy 2.8e-6 Objective function trend chart Helicopter Parameter w = 150, obj_tol = 1e-9, theta = 0.5, beta = 0.5, c = 0.01 Result hit tolerance @ iter #1367 with energy 4.21e-4 Objective function trend chart Laser Cutting I choosed Wu-Jing (Turnip-Head) for cutting. However, the initial support line is too short for inserting a foot, so I made another one which is stronger. .cls-1{fill:none;stroke:#010101;} 3.5.4 Equilibrium Neo-Hookean elasticity model is used Beam ρ\\rhoρ = 131131131 young = 3×1083 \\times 10^83×108 poisson = 0.20.20.2 iteration time = 100010001000 initial step size = 10−710^{-7}10−7 (Gradient Descent) 10−810^{-8}10−8 (BFGS) Linear Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Neo-Hookean Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Dinosaur ρ\\rhoρ = 131131131 young = 3×1083 \\times 10^83×108 poisson = 0.20.20.2 iteration time = 100010001000 initial step size = 10−810^{-8}10−8 (Gradient Descent) 5×10−95 \\times 10^{-9}5×10−9 (BFGS) Linear Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Neo-Hookean Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Ball ρ\\rhoρ = 131131131 young = 10610^6106 poisson = 0.20.20.2 iteration time = 100010001000 initial step size = 10−710^{-7}10−7 (Gradient Descent) 10−810^{-8}10−8 (BFGS) Linear Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Neo-Hookean Elasticity model Gradient Descnet BFGS NGC Residuals Total Energy Beam Without point load Mesh Objective With point load Mesh Dino Without point load Mesh Objective With point load Mesh Mean Curvature Flow Two Rings (Max iter,ϵ1,ϵ2)=(1000,5×10−2,10−3)(\\text{Max iter}, \\epsilon_1, \\epsilon_2) = (1000, 5 \\times 10^{-2}, 10^{-3})(Max iter,ϵ1​,ϵ2​)=(1000,5×10−2,10−3) Average Mean Curvature Final Mini Half Cube (Max iter,ϵ1,ϵ2)=(1000,5×10−2,10−3)(\\text{Max iter}, \\epsilon_1, \\epsilon_2) = (1000, 5 \\times 10^{-2}, 10^{-3})(Max iter,ϵ1​,ϵ2​)=(1000,5×10−2,10−3) Average Mean Curvature Final Mini Cube (Max iter,ϵ1,ϵ2)=(2,1,1)(\\text{Max iter}, \\epsilon_1, \\epsilon_2) = (2, 1, 1)(Max iter,ϵ1​,ϵ2​)=(2,1,1) Average Mean Curvature Final Mini My Shape (Max iter,ϵ1,ϵ2)=(300,0.5,1e−2)(\\text{Max iter}, \\epsilon_1, \\epsilon_2) = (300, 0.5, 1e-2)(Max iter,ϵ1​,ϵ2​)=(300,0.5,1e−2) Average Mean Curvature Final Mini Fitting Output Bob Gaussian curvature Mean curvature Principal curvature directions Asymptotic directions Bob Gaussian curvature Mean curvature Principal curvature directions Asymptotic directions","raw":null,"content":null,"categories":[],"tags":[{"name":"資工","slug":"資工","permalink":"https://blog.petingo.ch/tags/%E8%B3%87%E5%B7%A5/"},{"name":"Small Project","slug":"Small-Project","permalink":"https://blog.petingo.ch/tags/Small-Project/"}]},{"title":"Le Chasseron：每一塊雪，踩起來都不一樣","slug":"le-chasseron","date":"2022-02-13T13:22:15.000Z","updated":"2022-02-13T23:23:26.630Z","comments":true,"path":"le-chasseron/","link":"","permalink":"https://blog.petingo.ch/le-chasseron/","excerpt":"\n今天又匆匆忙忙的趕公車，還好這次有人提醒要帶太陽眼鏡跟手套，不然我可能真的會凍死在山上。\n不過還是少帶了一個東西—登山杖的擋雪片；而且今天去的地方雪都很深，好幾次登山杖插下去都差點拔不出來。\n這次的目標是上次露營車夫婦推薦的 Le Chasseron，位在 Jura 地區，需要在 Yverdon les Bains 轉車到 Sainte Croix。最後一段路上，火車兩旁盡是平坦的雪丘。","text":"今天又匆匆忙忙的趕公車，還好這次有人提醒要帶太陽眼鏡跟手套，不然我可能真的會凍死在山上。 不過還是少帶了一個東西—登山杖的擋雪片；而且今天去的地方雪都很深，好幾次登山杖插下去都差點拔不出來。 這次的目標是上次露營車夫婦推薦的 Le Chasseron，位在 Jura 地區，需要在 Yverdon les Bains 轉車到 Sainte Croix。最後一段路上，火車兩旁盡是平坦的雪丘。 原本以為 Sainte Croix 只是一個山裡小鎮，沒想到還挺熱鬧的。火車站旁的 Migros 似乎是一種繁榮的證明。Jura 地區的精密機械產業發達，也是瑞士鐘錶製造的主要中心；Sainte Croix 則聞名於音樂盒製造，車站旁的公廁外的告示牌上，還看到鎮上有一間自動機&amp;音樂盒博物館。 到登山口前，看到一間牆壁爬滿藤蔓的民宅；二樓的陽台則是掛滿了各式各樣的鳥屋。 一開始的路線是一個類似公園的地方，一邊是民宅，另一邊則充滿了一坨一坨的圓形草堆。 三間可愛小屋。 山中的小餐廳，一旁的儲藏室裡還有類似窯烤披薩的裝置。 小餐廳的旁邊有個滑雪纜車站，錯綜複雜的滑雪道似乎也在這裡交會。 很快就到稜線了。 這裡的積雪很厚，而且每一步都有一種奇妙的感覺；前腳一踩下去便會深深陷入雪中，後腳抬起來後，前腳又會再次下沉一點。大概就是在這個時候，我突然意識到，原來不同地方的每一塊雪，踩起來都不一樣。有的堅硬厚實且穩固、有的雖硬卻滑得無法行走、有的軟而綿密讓你深陷其中，有些鬆軟細散像沙灘一樣。 稜線上的景色。 稜線的另一端是接近 90 度的斷崖。 每次在山上從正上方鳥瞰這種小小的房子，都有一種在空拍機上的感覺。 剛剛經過的滑雪纜車站。 稜線上的風很大，即使帶著手套，手指依然幾乎失去知覺。 往三角點的路是向右傾斜的坡，植被與碎石也被薄雪覆蓋，而且雪面似乎因為太陽的照射而稍微融了一點，後面的路滑到幾乎無法向前。加上太陽也準備下山，我們決定就此折返。 遠方的三角點。 正好飛過一架輕航機。 好喜歡夕陽透著森林散落在白雪上的樣子。 下山的時候路太滑，我們還把路當溜滑梯溜了一下。 快下山時發現離太陽下山還有點時間，剛好路邊出現一塊空地，朋友便提議來堆雪人；無奈雪太鬆了，只能打雪仗跟棒球（？ 遇到騎馬的父（或阿公）女，好像電影裡的場景。 下山之後原本想在候車亭待到 7 點以後再用 seven25 搭車回家，但沒想到候車亭已經關門了，於是匆忙跳上準備發車的列車，用 3.70 換 1 小時的風寒。","raw":null,"content":null,"categories":[],"tags":[{"name":"山","slug":"山","permalink":"https://blog.petingo.ch/tags/%E5%B1%B1/"},{"name":"瑞士","slug":"瑞士","permalink":"https://blog.petingo.ch/tags/%E7%91%9E%E5%A3%AB/"}]},{"title":"Rochers de Naye 和 Montreux 耶誕市集","slug":"Rochers-de-Naye-and-Montreux-Noel","date":"2021-11-21T04:44:28.000Z","updated":"2021-11-21T23:50:23.488Z","comments":true,"path":"Rochers-de-Naye-and-Montreux-Noel/","link":"","permalink":"https://blog.petingo.ch/Rochers-de-Naye-and-Montreux-Noel/","excerpt":"\n一個算不上清閒的周末。\n這次的旅行似乎很久以前就約好了（？），但我意識到這件事情是在星期五晚上，群組裡一條沒頭沒尾訊息：「星期六怎麼約？」\n要去哪？做什麼？其實我根本不知道，我只知道 Geometric Computing 這周末的作業是新 Project，代表我有多一點點的時間可以浪費。","text":"一個算不上清閒的周末。 這次的旅行似乎很久以前就約好了（？），但我意識到這件事情是在星期五晚上，群組裡一條沒頭沒尾訊息：「星期六怎麼約？」 要去哪？做什麼？其實我根本不知道，我只知道 Geometric Computing 這周末的作業是新 Project，代表我有多一點點的時間可以浪費。 pannellum.viewer('panorama', { \"type\": \"equirectangular\", \"panorama\": \"/Rochers-de-Naye-and-Montreux-Noel/top-pano.png\" }); （第一次嘗試後製 360 度全景）","raw":null,"content":null,"categories":[],"tags":[{"name":"那些小事","slug":"那些小事","permalink":"https://blog.petingo.ch/tags/%E9%82%A3%E4%BA%9B%E5%B0%8F%E4%BA%8B/"},{"name":"山","slug":"山","permalink":"https://blog.petingo.ch/tags/%E5%B1%B1/"}]},{"title":"秋天小散步","slug":"take-a-walk-in-autumn","date":"2021-11-18T14:23:53.000Z","updated":"2021-11-22T13:32:10.737Z","comments":true,"path":"take-a-walk-in-autumn/","link":"","permalink":"https://blog.petingo.ch/take-a-walk-in-autumn/","excerpt":"\n被死線追著跑的生活大概是從開學第二周開始的吧！雖然總嚷嚷著要提高做事效率、減少耍費的額度，但大部分的時間卻還是渾渾噩噩的離我而去。\n今天的夕陽太美，反正，也不差這一個黃昏的偷閒。\n迅速整備好，趕在太陽還沒落下前衝去湖邊。","text":"被死線追著跑的生活大概是從開學第二周開始的吧！雖然總嚷嚷著要提高做事效率、減少耍費的額度，但大部分的時間卻還是渾渾噩噩的離我而去。 今天的夕陽太美，反正，也不差這一個黃昏的偷閒。 迅速整備好，趕在太陽還沒落下前衝去湖邊。 比起滿山遍野的通紅，亮黃色的秋天似乎更對我的胃口；尤其當黃澄澄夕陽灑落在秋天的葉子上，然後鑽過枝枒的空隙。 Port de Vidy 和金黃色的洛桑市區。 後面的小公園裡面有一處遊樂設施跟小火車，但今天沒看到火車在跑。 一旁銀杏的落葉染黃了整個「車站」，真的好美好美。","raw":null,"content":null,"categories":[],"tags":[{"name":"那些小事","slug":"那些小事","permalink":"https://blog.petingo.ch/tags/%E9%82%A3%E4%BA%9B%E5%B0%8F%E4%BA%8B/"}]},{"title":"碉堡","slug":"dream-blockhouse","date":"2020-08-04T16:46:40.000Z","updated":"2022-07-10T23:44:19.535Z","comments":true,"path":"dream-blockhouse/","link":"","permalink":"https://blog.petingo.ch/dream-blockhouse/","excerpt":"","text":"1 和平路變成河 我游泳游看到一隻狗 狗好像受傷 但我沒辦法救他 所以只好找人 走一走看到一張照片 我一開始猜那張照片拍的是某個地點 但結果是從國風後面的一條路往國風的方向拍 然後我就從那個地方開始走 走一走看到一個山丘 走上去發現很多人在拍照 他們好像是在拍日出或是日落 還有一群人在弄插畫什麼的 等他們結束以後一群人回去 但有幾個人走到山後面的房子 然後我也想看看就走過去 門是紅色的 其他地方都黑黑的 我把門推開 結果看到一大排佛像的頭 裡面有一個捲頭外國仔 我就說我想加入 他問我會什麼樣的藝術 我說攝影 他說好 然後我就加入了 2 又做了那個一直連貫的夢 夢的世界觀大概就是有一個很大的碉堡在中間 旁邊有護城河、後面有一個小山丘 山丘上有像長城那樣的城牆步道跟一個放滿佛頭、整間漆成紅色的寺廟 過了護城河以後會到一個商店街 商店街有一間夢裡很常去吃的排骨飯便當店 這次夢裡的設定是那個碉堡是我回台灣住防疫旅館 然後我忘記要做什麼事情所以出了房間門 結果走著走著就迷路了 之後我逆著一個溜滑梯走上去才找到自己的房門 看到那個房門配上後面的山丘的同時 我驚覺原來我之前一直做的夢是預知夢 預知我的防疫旅館的樣子 這時候突然一陣恐懼 我才想到剛才在路上走一個人都沒有 整個碉堡的人都消失了 所以我沒有回房間 反而一直在碉堡裡面走來走去 看能不能找到人 我當下的情緒是很慌張很恐懼的 有一種被世界拋棄的感覺 好像我所有的情感都是虛假的 感覺我被強迫參與了某種實驗（夢裡的用詞好像是恐懼心理實驗 就是測試把一個人孤單的關在某個地方 看看他會有什麼反應之類的） 總之我後來是在某個類似實驗室的地方找到其他人 大概就是我去布拉格交換遇到的那些跟一個不認識、有種主任氣質的老肥男還有一個類似助理的大嬸 我一直質問他們到底是不是在做某種實驗 他們都積極地否認 但他們被我發現之後一直都不跟我說話 也不是不跟我說話 就對我的回應很冷淡 我感覺他們是在進行某種實驗 所以一直在觀察我 然後又不能跟我說實驗內容所以才會對我很冷漠 我在那個碉堡裡面好像被不允許做某些事情 所以看到他們以後我就一直問一個阿綺 可不可以怎樣可不可以怎樣 問了兩三個問題吧 一開始他幾乎都是很明確的秒答可以或不行 然後我頓了一下 又問了他一個問題 它想了很久都沒有回應 之後就不知道為什麼移動 好像是因為實驗ㄅㄧㄚ坑的關係 但我也只能用猜的 這時候主任男好像有點不太高興 但跟其他人的相處模式又都回歸正常了 就像出去玩那樣會一邊聊天一邊走路 移動的路線會經過之前也出現過的高跳台 那個高跳台是沒有柵欄的 很高 然後有水會像瀑布一樣一直流下去 那個高度直接跳下去可能會摔死 不過底下又有水可以緩衝所以不確定 輪到我的時候因為底下已經有人了（應該是小白，然後還有另一個人） 我就問他說是不是直接跳下去 他說不是 旁邊有一個隱藏在水裡面的樓梯 我就走那個樓梯下去了 下去以後會先接到一個雙層旋轉門（上面是旋轉門、下面是柵門） 一般的人會很直覺的走上面那個旋轉門 但其實如果你走上面的旋轉門會被卡住 正確的走法是把上面的旋轉門轉到一個角度 然後再推下面的柵門 他原本的柵欄會開一個洞然後固定起來 這樣就可以從下面的門縫直接通過 結果 Jennifer 不知道 就被卡在上面 然後我跟 Joyce 就幫忙把他弄下來 之後沒發生什麼特別的事情就走出碉堡了 走出碉堡之後又到了熟悉的排骨便當店 那間排骨便當是你要自己去拿飯盒裝飯跟自助夾菜 夾完之後再結帳 然後我不知道在想什麼 進去就只是坐著等 等了很久才想到這家店的運作模式是要先自己弄好飯菜 然後才跑去櫃台 結果夾菜的時候香（同行的女生）剛好在我前面 她說她剛也忘記這間店的規矩了 然後我好像還有跟那邊的煮菜阿桑聊天 醒來的時候手超麻 好像每次做這個夢都會這樣 搞不好是要手麻才能開啟這個夢的通道","raw":null,"content":null,"categories":[],"tags":[{"name":"醒來時還記得的夢","slug":"醒來時還記得的夢","permalink":"https://blog.petingo.ch/tags/%E9%86%92%E4%BE%86%E6%99%82%E9%82%84%E8%A8%98%E5%BE%97%E7%9A%84%E5%A4%A2/"}]},{"title":"關於可能性","slug":"about-possibility","date":"2020-05-08T07:32:07.000Z","updated":"2021-11-21T21:20:00.051Z","comments":true,"path":"about-possibility/","link":"","permalink":"https://blog.petingo.ch/about-possibility/","excerpt":"\n最近做了一個蠻重大的決定：把建築輔系放棄了。\n原因也沒多複雜，最主要的原因是找到 Computer Vision 方面的研究助理工作，可以填補準備出國的這半年；再加上我覺得我對建築的喜愛其實比較像是對於 A 片的那種感覺（就像是看到漂亮的女優會很興奮，會想把好看好用的片子存在播放清單裡面那樣，但不會把拍 A 片當成一個的具體的目標或夢想，但如果有機會的話也不會太排斥這樣），我喜歡建築、喜歡畫畫，也一直想設計自己的未來的房子，但對於跳進建築這個產業反倒沒有這麼大的熱忱。","text":"最近做了一個蠻重大的決定：把建築輔系放棄了。 原因也沒多複雜，最主要的原因是找到 Computer Vision 方面的研究助理工作，可以填補準備出國的這半年；再加上我覺得我對建築的喜愛其實比較像是對於 A 片的那種感覺（就像是看到漂亮的女優會很興奮，會想把好看好用的片子存在播放清單裡面那樣，但不會把拍 A 片當成一個的具體的目標或夢想，但如果有機會的話也不會太排斥這樣），我喜歡建築、喜歡畫畫，也一直想設計自己的未來的房子，但對於跳進建築這個產業反倒沒有這麼大的熱忱。 或許還是錢吧？在聽過那麼多人抱怨建築系的低薪、高工時以後，這種「要嘛功成名就、要嘛天天吃大便」，完全令人摸不著頭緒的黑盒子著實令人卻步。而且我自知自己不是一個擁有天馬星空想像力的創造者；也不是一個可以口若懸河地把自己的作品吹得一塌糊塗的演說家（尤其是在上完一個學期的建築設計以後），也許有機會成為一個中規中矩的勞動階級，但我可能終其一生都無法企及我對其嚮往的最終形態。 相較之下，寫 code 至今還是能帶給我很多快樂，我也很樂意把我的餘生用在這裡。或許是認清到自己的不足，才能對此如此豁達吧？我嚮往成為時代的革命者，但同時也樂於只當一顆小齒輪，為這個世界的向前提供一點點支撐或動力。「希望我的存在可以讓世界變得更美好一些些」這句話依舊還是我的座右銘。 不過也不是一直朝著同個方向就是了。從很久以前想著大學畢業就要去工作賺錢、到現在思考著 phD 的可能性，如今我還是不確定該怎麼向前。我們做決定時往往都只是靠著經驗來算計未來；但如果只能用趨近於零的過往去想像未來的可能性，大概與擲骰子無異。只祈求中研院的半年可以把那足以填滿黑洞的未來想像描出一個比較清晰的輪廓，現在姑且就走一步算一步吧。 至於結合資工的專業與建築的興趣？現在比較常見的應該是數位建築的部分吧？但這個領域始終激不起我的興趣，我喜歡建築純粹的美、傳統的美、藝術的美，但總感覺現在大部分的數位建築和我心中對建築美的定義有著蠻大的差距。原本想說暫且算是放棄了吧！但想到這裡又覺得或許不完全是這麼一回事，也許聖母院的重建會需要數位建築的輔助？如果把數位建築應用在古蹟修復的部分或許還蠻有趣的？不知道，不過暫且還是把他們放在各自的位子吧。（但我還沒有放棄成為一個建築模型 youtuber 的夢想，也許回台灣就開始嘗試？）（希望可以說到做到） 記得上個月看完排球少年的時候曾經想過，如果高中時有看那些熱血社團的動畫（上低音號、排球少年、乒乓這類的），當時的我會不會也因此把奧林匹亞當成唯一的目標，不計後果的認真燃燒一次呢？現在想一想，當時去全國賽的時候大概是處在達克效應的愚昧山丘吧，如果填志願時的知識量剛好成長到絕望山谷，我會不會反而走向完全不同的地方呢？ Whatever，我們都是過去的選擇所成就的，努力成為最好版本的自己吧。","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"},{"name":"資工","slug":"資工","permalink":"https://blog.petingo.ch/tags/%E8%B3%87%E5%B7%A5/"},{"name":"建築","slug":"建築","permalink":"https://blog.petingo.ch/tags/%E5%BB%BA%E7%AF%89/"}]},{"title":"台科成績單生成","slug":"NTUST-Transcript-Generator","date":"2020-04-23T15:48:06.000Z","updated":"2021-11-22T23:04:32.197Z","comments":true,"path":"NTUST-Transcript-Generator/","link":"","permalink":"https://blog.petingo.ch/NTUST-Transcript-Generator/","excerpt":"\n\n 簡介\n一個利用學生資訊系統的資料生成成績單的 chrome 插件，可以用在比較沒那麼正式的場合。\n前幾天在準備丟 Google Student Internship 的時候，發現他們要求上傳成績單，並且特地標註了「non official transcript is accepted」；由於人在國外沒法印成績單，直接截圖又覺得有點 low，於是順手刻了這個外掛。","text":"簡介 一個利用學生資訊系統的資料生成成績單的 chrome 插件，可以用在比較沒那麼正式的場合。 前幾天在準備丟 Google Student Internship 的時候，發現他們要求上傳成績單，並且特地標註了「non official transcript is accepted」；由於人在國外沒法印成績單，直接截圖又覺得有點 low，於是順手刻了這個外掛。 相關連結 Chrome 商店 Github 使用說明 先登入學生資訊系統，並進入成績查詢頁面 打開插件泡泡，輸入基本資料並按生成 然後可以用列印功能生出 PDF 生成範例 中文 英文","raw":null,"content":null,"categories":[],"tags":[{"name":"Small Project","slug":"Small-Project","permalink":"https://blog.petingo.ch/tags/Small-Project/"}]},{"title":"數位相機理論與實務期末考","slug":"Digital-Camera-final","date":"2019-11-04T02:09:36.000Z","updated":"2021-11-23T00:15:20.497Z","comments":true,"path":"Digital-Camera-final/","link":"","permalink":"https://blog.petingo.ch/Digital-Camera-final/","excerpt":" 一、名詞解釋\n 1. Uniform Color Space\n將色彩用 hue, lightness, chroma 三個數值來表示。該色彩空間的好處在於兩顏色的色差會與其座標的距離相等，實務上會比較好操作。\n\n 2. 3A\n\nAuto Focus：自動對焦——將焦距調整到正確的位置，使目標物清晰。\nAuto White Balance：自動白平衡——去除環境光的影響，還原物體的真實色彩。\nAuto Exposure：自動曝光——藉由調控光圈、快門、ISO 值還原環境的光強度。\n","text":"一、名詞解釋 1. Uniform Color Space 將色彩用 hue, lightness, chroma 三個數值來表示。該色彩空間的好處在於兩顏色的色差會與其座標的距離相等，實務上會比較好操作。 2. 3A Auto Focus：自動對焦——將焦距調整到正確的位置，使目標物清晰。 Auto White Balance：自動白平衡——去除環境光的影響，還原物體的真實色彩。 Auto Exposure：自動曝光——藉由調控光圈、快門、ISO 值還原環境的光強度。 3. Black Body Radiation 處於熱力學平衡狀態的黑體發出的輻射。所謂黑體是一個理想化的模型，可以吸收所有照射於表面的電磁波，在不同溫度下會釋放出不同的光譜，呈現不同的色彩，而此溫度（K）－色彩的對應關係即是色溫。 4. Independent color space 利用色彩模型和色域將顏色定義，使得不同設備之間可以藉由某種轉換而呈現相同的顏色，不會因為機器的不同而產生色差。 二、簡述 DSC 動作原理，請以方塊圖說明之。 光線經過鏡頭的透鏡、反射鏡後，攝影師可以從觀景窗看到取景的內容。另外會有一部分的光線被反射到 Autofocus module，讓相機進行自動對焦之類的操作。 快門擊發時，反射鏡會縮下去、快門會打開，光線經過透鏡以後會先經過 low pass filter、micro lens array、color filter array，最後成像在感光元件上面，經過信號調整、數位轉換、色彩處理（解馬賽克、白平衡等等）、影像增益（和壓縮），最後儲存成照片。 三、簡述 DSC 如何進行色彩校正及其原理。 在標準光源下先用 DSC 拍攝 Macbeth Color Checker 之類的色校卡取得色塊值，再利用色彩檢測儀拍攝獲得該色彩的參考值（或直接利用廠商提供的）；將其轉換到標準空間以後，再利用兩者計算色校參數，未來拍攝的時候就可以直接將此參數套用在拍攝的影像上校正色彩。其原理是利用轉換矩陣使 DSC 拍攝下來的數值可以映射到對應的參考值上面，還原正確的色彩。 四、簡述 White Balance 一個物體呈現的顏色可以視作「物體本身的顏色＋物體反射環境光的顏色」，白平衡目的在於去除環境光對物體顏色造成的影響，還原物體原始的顏色，常用的做法有 Gray World 、Retinex 兩種。 Gray World： Gary World 的理論認為色彩是均勻分布的，因此將 RGB 平均以後應該會接近灰色。實作上先定義參考灰(G)，計算原圖 RGB 各自的平均(G’)，計算 G/G’ 的比值，然後根據此值調整 RGB 的數值。 Retinex： Retinex 的理論認為原始影像(S)、物體(B)、環境光(L) 的關係為 log(S) = log(B) + log(L)，其中環境光被認為是原始影像中低頻資訊；實務上藉由高斯模糊得到低頻影像(D)，再利用 log(S) - log(D) 得到高頻影像(G)，對 G 取反對數 exp(G) 即可得到正確顏色的影像 B。 五、如何評估數位相機影像品質？說明如何實踐 影像品質可由以下 8 點來評估，旨在還原真實場景的顏色、細節、光線對比強度等等。 Color Reproduce (CR) 色彩再現性 Color Rendering Index 演色性指數 Auto White Balance 自動白平衡 MTF (解析度） SNR （雜訊比） Uniformity （均勻度） Dynamic range （動態範圍） Veiling Flare （炫光） 色彩再現性 還原色彩的程度，可以藉由計算色校卡照片與實驗室測得的色彩之間的差異 ΔEab 來評估其色彩再現性。 解析度 解析度為相機對於細節的還原能力，實務作法為拍攝 ISO 12233 chart 以後，再藉由 MTF 值分析，若在細節處黑線和白線糊在一起，表示解析度不夠，MTF 值會降低。 而解析度又可再細分為： 垂直解像力 水平解像力 中央對焦區 對角線解像力 對比指示 Uniformity 在均勻的光線下拍攝單色的內容，根據此公式即可算出均勻度，PSNR 越高表示品質越佳：","raw":null,"content":null,"categories":[],"tags":[{"name":"筆記","slug":"筆記","permalink":"https://blog.petingo.ch/tags/%E7%AD%86%E8%A8%98/"}]},{"title":"建築十二問期中心得","slug":"Arch-12","date":"2019-10-19T16:45:45.000Z","updated":"2021-11-23T01:10:19.477Z","comments":true,"path":"Arch-12/","link":"","permalink":"https://blog.petingo.ch/Arch-12/","excerpt":"\n幾個禮拜下來，最喜歡的，莫過於第六周曾令理教授的演講，聽完演講時內心深處一股對創作的熱情真的是瞬間瞬間爆發。雖然一開始的講師的研究所作品（佛羅里達洞穴）讓我很不以為然；但後面介紹 Heatherwick studio 的作品時，無論是倫敦奧運聖火台、會勃起的橋、酒廠、新加坡大學，都讓我深感設計的創意是無邊無際的，但在其天馬行空的同時，卻又離我們的生活這麼近。","text":"幾個禮拜下來，最喜歡的，莫過於第六周曾令理教授的演講，聽完演講時內心深處一股對創作的熱情真的是瞬間瞬間爆發。雖然一開始的講師的研究所作品（佛羅里達洞穴）讓我很不以為然；但後面介紹 Heatherwick studio 的作品時，無論是倫敦奧運聖火台、會勃起的橋、酒廠、新加坡大學，都讓我深感設計的創意是無邊無際的，但在其天馬行空的同時，卻又離我們的生活這麼近。 雖然這門課叫「建築十二問」，但課堂中我最喜歡，同時也印象最深的的是第六堂課所介紹的倫敦奧運聖火台。他們讓每個國家在進場時，放一朵代表國家的花在聖火台上散亂的柱子上，最後再將它們一同高高舉起、聚集，原本四散的火苗頓時變成一束火炬。美當然不在話下，但它呈現的故事與象徵意義更是令人感動。同時，Heatherwick 團隊把以往最不起眼、轉瞬即逝的部分做到令人永生難忘，這樣的精神更是值得敬佩。 有個故事我後來還不斷轉述給朋友聽：Cooper Union 的創辦人在建校之時，相信未來「電梯」會被發明，於是在建築的中央留下了一塊圓形的空位。後來也真的靠著數代以後師生的努力，把這部圓形的電梯打造出來。想到這裡不禁又豎起雞皮疙瘩，這種超越時代的想像力與堅實執行力的搭配，無疑是每個創作者所嚮往的。 （Cooper Union 的電梯本尊） 許多課堂會討論「設計與藝術」的區別；講師說過「創造，就是找到有用的組合」、Heatherwick studio 的守則有著「No Style But system」、「創作才是我們追求的，不是風格」我想這也是對於這個問題的一個回答；很多時候藝術、藝術家會和風格畫上等號，所謂的「成名」往往也就是當特定的風格與藝術家的名字可以相互連結之時，古典的畢卡索與抽象派、莫內與印象派，現代的朱銘與粗獷的太極石雕、村上隆與超扁平。對比設計的創造，個人風格反倒退居其次（不過也是有安藤忠雄與清水模這樣的例子），理念的傳達與整體的配合才是設計的重點。 好比 Heatherwick studio 幫 Google 設計總部大樓時，原本鏤空天花板的設計在考量了當地炎熱的氣候後，改良成半開、可調整進光量的天窗；相較之下，LV 找草間彌生設計室內空間時，反倒是犧牲實用性來換取藝術的呈現。 （興建中的 Google 總部） （Louis Vuitton x 草間彌生） 講師在一開始也有提到關於跨領域的思考，身為一個資工輔修建築的學生，可以說是蠻有感觸的。在一個領域待久了，思想與思考著實會漸漸僵化，過度的分工導致沒有辦法跨領域的思考；而解決之道，便是動手實做，我非常認同。就我自己的經驗，無論是在資工的實做或是設計時的模型製作，收穫最多的往往都是真正動手之時。透過實際的操作學習，也在驗證思想合理性的同時併發更多創意與想法。 再來我想說說關於第五周的內容。 講師有提到的一個想法我非常認同：先有景觀、再有建築。去到國外旅遊時，尤其到了歐洲、日本，我們總會覺得相機拿起來隨便一拍，都是一張漂亮的照片；記得去年看過一篇社論，介紹了各國都市規劃的小細節，同時探討台灣街頭「亂象」的改進之道。當中提到了日本京都對於街道上廣告招牌的規範，包含其大小、擺放位置，甚至規定明度彩度不得超過標準，跨國企業如麥當勞、7-11都必須重新招牌，其最終的目的便在創造「和諧」的街頭景觀。很久以前「全能住宅改造王」有去法國取景，當中也提到法國政府明文規定老街的房屋裝修時，不得更動其特色外牆（全白的石造建築），但內部可以隨意更動，藉由這樣的限制將老街建築的外貌保留下來。 （京都景觀條例中，關於看板顏色與位置的示意圖） 說起台灣的街頭，一言以敝之就是「亂」；雖然說這也算是一種特色，但並不是什麼值得稱讚的地方。而之所以會亂，最大的問題就是沒有整體感，大家各自為政，既使獨立出來都是非常好看的東西，放在一起，缺乏整體感通常就不會美，何況單獨出來就不好看。另一方面或許是台灣原本就亂，導致大部分的人不太在乎整體市容的觀感、沒有從小在生活中培養美感；許多人說鐵皮屋就是破壞市容的最大元兇，但其實鐵皮屋也可以蓋得很好看啊！重點在「整體性」有沒有被建立。 （隨便從相簿翻出來的一張照片，但我覺得這張照片完整描述了台灣街景的刻板印象） 所以說「先有景觀，再有建築」我覺得是一個很棒的概念，藉由景觀的建立，後續的建築再配合景觀進行設計，建立整體感，或許是一個改善市容不錯的方式。 講師一開始在介紹皇家公園改建、City in the garden 廢棄道路變公園的主題時，也提到幾個不錯的概念，像是欄杆採用鋼板材質，利用其反射消除的突兀，達到一種隱形斗篷的感覺，或是利用淺、深色的地板鋪面區隔流動與停駐的口袋空間，感覺都是很實用的技巧。還有以草地取代塑膠玩具，這點我非常贊同，塑膠玩具不僅破壞城市的美感，更破壞生態環境，希望這樣的概念可以被廣泛接受。 Image Credit: BIG + HEATHERWICK STUDIO’S GOOGLE HEADQUARTERS ROOF CONSTRUCTION PROGRESS Smithsonian Magazine/This Innovator Thought Elevators Should be Round de zeen/ Louis Vuitton &amp; Kusama concept store at Selfridges 京の景観ガイドライン 広告物編","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"},{"name":"筆記","slug":"筆記","permalink":"https://blog.petingo.ch/tags/%E7%AD%86%E8%A8%98/"}]},{"title":"洗腦學校","slug":"brain-wash-school","date":"2019-10-18T08:56:11.000Z","updated":"2022-07-10T23:45:15.775Z","comments":true,"path":"brain-wash-school/","link":"","permalink":"https://blog.petingo.ch/brain-wash-school/","excerpt":"","text":"夢中全世界的人都在一間類似學校的機構裡面學習，我的媽媽和姐姐同時也是我的同學。 突然有一天，我發現他們所謂的教學其實是在洗腦（或是催眠）；而洗腦的最終階段就是會喪失自我意識，變成徒有軀體的空殼，只會一昧的接受總司令所下達的指令、照著其意志行動。但不管我跟誰說這件事，幾乎沒有人願意相信我，大家都覺得我瘋了。 老爸好像因為某種特殊的關係，並沒有和一般人一起上課（可能跟我一樣曾經發現他們其實是在洗腦）。我跟老媽說這件事情的時候，她也只說了：「噓！不要再講了。」就轉頭繼續上課了 我猜應該是因為老爸曾經跟她說過類似的事情，然後就被抓走了。 總之我就一邊上課，一邊籌組一個反抗組織、在學校裡面吸收認同我想法的人，準備一舉推翻他們的行動。但是出於某種特殊的原因，我如果要救老爸，就必須繼續假裝被洗腦（其實也蠻合理的）。夢醒前的畫面大概是在學校一邊假裝上課一邊和同伴討論該怎麼行動。 詳細的內容醒來的時候就忘得差不多了，但是現在回想起來還是有一種深深的恐懼。 全世界的人都擁有與你相反的思想、不認同你所認知的事實，每天都面對著被組織發現的恐懼，有時候甚至會自我否定，覺得自己其實真的是瘋子；甚至也曾經想，或許假裝不知道有這件事，跟著大家一起被洗腦，就不會那麼痛苦了（也許老媽便是屬於這樣的人） 但我也記得夢裡有一扇門，門後面有光，從它微微打開的隙縫中漫開。 就是那道光讓我有繼續向前的決心與勇氣。","raw":null,"content":null,"categories":[],"tags":[{"name":"醒來時還記得的夢","slug":"醒來時還記得的夢","permalink":"https://blog.petingo.ch/tags/%E9%86%92%E4%BE%86%E6%99%82%E9%82%84%E8%A8%98%E5%BE%97%E7%9A%84%E5%A4%A2/"}]},{"title":"VFX Project - HDR","slug":"VFX-HDR","date":"2019-04-03T17:04:05.000Z","updated":"2021-11-23T00:42:46.417Z","comments":true,"path":"VFX-HDR/","link":"","permalink":"https://blog.petingo.ch/VFX-HDR/","excerpt":"\nIn this project, we implemented Paul Debevec’s method to assemble an HDR image. For extension, we implemented MTB alignment algotirhm.\nLink to Code: Github","text":"In this project, we implemented Paul Debevec’s method to assemble an HDR image. For extension, we implemented MTB alignment algotirhm. Link to Code: Github Run the code Use python3 to run the code, and the dataset is the path to image resource. 123cd codepython3 HDR.py ../datasetpython3 HDR-YUV.py ../dataset openCV and exifread is necessory to run the program. 12pip install opencv-pythonpip install ExifRead HDR For HDR image recovery, we implemented Paul Debevec’s method. Using RGB channels Separate the image into RGB channels. For each channel, we randomly choose 100 pixels to find its response curve. For solving the over-determined linear system, we use numpy’s lstsq function. Construct the raidance map for each channel and merge them together. Then, we can get the HDR image. Tone mapping We tried to implement the Gradient Domain algorithm for tone mapping, which should have worked fine if coded properly, but we failed to do so. (The code is still included.) We now use openCV’s built-in tone mapping method to transfer the HDR image into a LDR one. However, though the quality is tolerable, some overexposed spots we can’t eliminate appear in some cases. Using YCbCr channels Then, we tried to convert the color space from RGB to YCbCr, and only reconstruct the HDR image of Y channel, which represents the luminance. For the chroma channels, we weighted average them by the luminance difference between the original photos and the recovered one. With this method, the color is better preserved, and the recovered HDR image seems more like the original photo. However, it sometimes results in strange HDR image which has too strong color saturation. Alignment Here is an example of the result of our MTB alignment. The two HDR images are generated from the same image set, but the right one was processed after aligning. What We Learned The most interesting part of this project is how response curve is constructed. It is our first time to know how math, especially linear algebra, is so important for creating and implementing an algorithm. Team Member Me &amp; ZL Yu","raw":null,"content":null,"categories":[],"tags":[{"name":"Small Project","slug":"Small-Project","permalink":"https://blog.petingo.ch/tags/Small-Project/"}]},{"title":"高速公路車速預測","slug":"Highway-Average-Speed-Prediction","date":"2018-12-14T16:33:43.000Z","updated":"2021-11-23T00:41:14.597Z","comments":true,"path":"Highway-Average-Speed-Prediction/","link":"","permalink":"https://blog.petingo.ch/Highway-Average-Speed-Prediction/","excerpt":" 資料集與目標\n此為物聯網與資料分析的作業五，本題旨在利用高速公路交通流量資料，來預估 30 分鐘後的平均車速；下表為資料各欄位的詳細說明\n\n\n\n欄位名稱\n內容介紹\n資料格式\n\n\n\n\nTimestamp\nThe time時間MM/DD/YYYY HH24:MI:SS. （5 分鐘）\ntimestamp\n\n\nStation ID\n高速公路站點ID （這次資料全部都是1108687）\ninteger\n\n\nFreeway\n高速公路ID （這次資料全部都是5）\ninteger\n\n\nDirection of Travel\n站點的道路通往方向（東西南北） （這次資料全部都是N）\nstring\n\n\nStation Type\nML = Main line 主線道\nstring\n\n\nSamples\n全部道路（lanes）5分鐘內有多少sample\ninteger\n\n\n% Observed\n全部道路之觀察數據比例\t [（觀察筆數+缺失填入筆數）/全資料數]\npercentage\n\n\nTotal Flow\n全部道路5分鐘內車流量 。 （少於10筆資料的使他乘以（10/好樣本數量））\t（-1代表無資料）\ninteger\n\n\nAverage Occupancy\n五分鐘內所有道路的平均佔有率 （某時段內偵測到車子的頻率）\npercentage\n\n\nAverage Speed\n所有車道在5分鐘内的流量加權平均速度mph（每條道路速度每條道路流量加總 / 每條道路流量加總）\nfloat\n\n\nLane “N” Samples\n第N道路之5分鐘內sample數量\ninteger\n\n\nLane “N” Flow\n第N道路之5分鐘內所有流量 。（少於10筆資料的使他乘以（10/樣本數量））\ninteger\n\n\nLane ”N” Average Occupancy\n第N道路之平均佔有率\npercentage\n\n\nLane ”N” Average Speed\n第N道路之平均速度\nfloat\n\n\nLane “N” Observed\n第N道路之觀察數據比例 （觀察筆數+缺失填入筆數）/全資料數\npercentage\n\n\n","text":"資料集與目標 此為物聯網與資料分析的作業五，本題旨在利用高速公路交通流量資料，來預估 30 分鐘後的平均車速；下表為資料各欄位的詳細說明 欄位名稱 內容介紹 資料格式 Timestamp The time時間MM/DD/YYYY HH24:MI:SS. （5 分鐘） timestamp Station ID 高速公路站點ID （這次資料全部都是1108687） integer Freeway 高速公路ID （這次資料全部都是5） integer Direction of Travel 站點的道路通往方向（東西南北） （這次資料全部都是N） string Station Type ML = Main line 主線道 string Samples 全部道路（lanes）5分鐘內有多少sample integer % Observed 全部道路之觀察數據比例 [（觀察筆數+缺失填入筆數）/全資料數] percentage Total Flow 全部道路5分鐘內車流量 。 （少於10筆資料的使他乘以（10/好樣本數量）） （-1代表無資料） integer Average Occupancy 五分鐘內所有道路的平均佔有率 （某時段內偵測到車子的頻率） percentage Average Speed 所有車道在5分鐘内的流量加權平均速度mph（每條道路速度每條道路流量加總 / 每條道路流量加總） float Lane “N” Samples 第N道路之5分鐘內sample數量 integer Lane “N” Flow 第N道路之5分鐘內所有流量 。（少於10筆資料的使他乘以（10/樣本數量）） integer Lane ”N” Average Occupancy 第N道路之平均佔有率 percentage Lane ”N” Average Speed 第N道路之平均速度 float Lane “N” Observed 第N道路之觀察數據比例 （觀察筆數+缺失填入筆數）/全資料數 percentage SVM SVM 介紹 SVM是一種可以將資料做分類的機器學習方法，如下圖所示： 有黑點和白點兩群資料集，直線H1切過兩者中間、H2雖然成功分割但是距離差異太近、H3則可以成功分割且距離最大。如果資料呈現類似環狀分布，二維平面中無法直接分割，可以透過一kernel matrix將其轉換到高維平面中即可順利分割。 類似的方法也可以用於迴歸分析（我們這次的作業），簡單介紹參數 kernel：將資料轉換到高維空間所使用的方法，這裡我們使用預設的RBF （https://zh.wikipedia.org/wiki/径向基函数核） gamma： 影響上圖中藍點和紅點在高維空間中的距離 C：SVR會使用一部分的資料訓練，剩下的用作測驗，C 即預測值和實際值落差過大時，要在 loss function 中給予懲罰的係數。 epsilon：承上，當誤差小於給定的值時便不予懲罰。 Result &amp; Discussion 結果圖 藍色點為原始資料集；綠色線為模型的預估結果 Score = 10.98746 Score = 14.31129 分析與討論 失敗的模型 一開始，我們直覺地認為車速與一天當中不同的時間有關；在上下班時間因為車多擁擠，導致時速下降、在凌晨時分因為車少，平均速率便會上升。於是我們將不同日子裡相同時間的速度平均，做成下列的表格（僅為示意）： 12345average_speed[\"00:00\"] = 68.21average_speed[\"00:05\"] = 69.53average_speed[\"00:10\"] = 70.22...average_speed[\"23:55\"] = 67.91 做出表格以後，再利用普通的線性回歸內插出所有時間的數值；但結果在 kaggle 上僅得到 35 分左右，可以說是奇慘無比。 利用 SVR 後來我們利用時間戳記、當前速率、總流量三者作為輸入，並利用 sklearn 提供的函示庫實作。 經過幾次的試驗以後，我們在 kaggle 拿到的兩組最好成績分別是 10.98746 和 14.31129，兩者唯一的差別在於時間的 normalization；在 10.98746 的部分，時間是直接使用原始的 timestamp，但由於 kaggle 上的測試數據包含在訓練數據中，我們認為結果會大大的受到其影響。也就是說，我們用 1 月 1 日到 2 月 5 日的資料來訓練；假設 1 月 21 日時有突發狀況導致平均車速減少，因為時間戳記是唯一的，會受到其權重的影響，我們訓練出的 model 可能會有 over-fitting 的情況，如果利用此模型預估 5 月 20 日的車流可能會有問題。 在把資料視覺化以後，我們可以輕易的觀察出其平均速率是有週期性的變動，大約是以一個禮拜為單位。於是我們將時間戳轉換為「在一個禮拜裡的某個時間」（即 mod 60∗60∗24∗7\\bmod 60*60*24*7mod60∗60∗24∗7），並正規化（映射到 0~1 的區間）。雖然在 kaggle 上並沒有獲得比較好的分數，但我們認為這是一個比較 general 的模型，比較能夠應付不同的狀況。","raw":null,"content":null,"categories":[],"tags":[{"name":"Small Project","slug":"Small-Project","permalink":"https://blog.petingo.ch/tags/Small-Project/"}]},{"title":"去了中國一個月","slug":"One-Month-In-China","date":"2018-09-09T17:08:30.000Z","updated":"2021-11-21T19:53:45.381Z","comments":true,"path":"One-Month-In-China/","link":"","permalink":"https://blog.petingo.ch/One-Month-In-China/","excerpt":"其實原本是打算每天晚上睡覺前寫點什麼，紀錄一下每天看到的、想到的、感受到的人事物。\n結果…連第一天的日記都只打了草稿，只好來寫月記了。\n結果寫完 Day 1 之後就完全忘記這回事了，現在連回憶錄都可能都寫不出來了…（2020/4/1，布拉格）","text":"其實原本是打算每天晚上睡覺前寫點什麼，紀錄一下每天看到的、想到的、感受到的人事物。 結果…連第一天的日記都只打了草稿，只好來寫月記了。 結果寫完 Day 1 之後就完全忘記這回事了，現在連回憶錄都可能都寫不出來了…（2020/4/1，布拉格） 所以你覺得支那怎麼樣？ 回來之後最常被問的大概就是這個問題了，用四個字概括就是「垃圾地方」。 食物可能是唯一會讓我留戀的。四季民福的烤鴨和鬆到不能再鬆的炒飯、學校超市裡一斤 18 羊的現包水餃、肉夾饃、胡蘿蔔汁、公主墳超市裡一串5羊的肉串、中關村食寶街的豬腦和煎粉之類的迷樣小吃、散步街的炒羊肚、故宮前面一大條2羊的超甜哈密瓜、各式各樣便宜又好吃的水果、牛奶冰淇淋，大概就這些吧！ 有好吃到唇齒留香的食物當然就會有雷到難以忘懷的。記得第一天剛到學校，臨時在學校找了一間小餐館，點了一碗 9 羊的涼粉。確切的味道我已經不記得了，只記得是一股臭酸的餿水味，我勉強吃掉半碗後還是選擇放棄，或許那真的是從廚餘桶湊出來的食物也說不定。之後的那幾天我再也沒有點過涼粉。另一個是辣到爆炸的牛雜麵，所謂的爆炸是真的爆炸，吃完那碗牛雜麵後，整整一個禮拜都在胃痛和拉肚子。不過這應該只是我耐受力不夠而已吧！如果是四川人來吃搞不好還會覺得不夠呢！ 不過說到吃就不得不提「錢」這回事，不管是在北京還是上海，既使是觀光景點，物價也都還在可以接受的範圍內，平均的物價大概是台北 ±50% 吧，如果用大麥克經濟的角度來看，北京的麥當勞還比台北貴呢！但是在北京或上海晃了那麼久、看了那麼多徵才廣告，打工時薪最高也只有 22 人民幣，是一間位在食寶街（京中關村軟體園區附近，類似百貨公司的美食街）裡的 pizza hot 貼出來的，其他地方大概都是 14~16 元左右。 除了食物以外呢？ 每天打開窗戶看到的就是無盡的霧霾，藍天什麼的似乎是一件遙不可及的夢想，幾乎只能用看得見太陽和看不見太陽來區分晴天與陰天，走在路上大概 3~5 公尺外的景物就會蒙上一層白白的面紗。原本以為北京的緯度可以減輕一點夏季的酷熱，但不知道是不是受霧霾的溫室效應影響，悶熱與黏膩依舊，甚至還比台灣還要難受。","raw":null,"content":null,"categories":[],"tags":[{"name":"北航","slug":"北航","permalink":"https://blog.petingo.ch/tags/%E5%8C%97%E8%88%AA/"},{"name":"那些小事","slug":"那些小事","permalink":"https://blog.petingo.ch/tags/%E9%82%A3%E4%BA%9B%E5%B0%8F%E4%BA%8B/"}]},{"title":"北航 Day 1","slug":"Beihang-Day-1","date":"2018-07-07T16:35:30.000Z","updated":"2021-11-21T19:53:52.961Z","comments":true,"path":"Beihang-Day-1/","link":"","permalink":"https://blog.petingo.ch/Beihang-Day-1/","excerpt":"\n第一次出國，第一次一個人出國。\n我現在能安心的坐在床上寫這些廢話也是歷經了一番神奇的旅程。","text":"第一次出國，第一次一個人出國。 我現在能安心的坐在床上寫這些廢話也是歷經了一番神奇的旅程。 原本預計今天要把棉被抬到新家再出門，結果不小心多睡了半小時、又被一坨爆幹貴的早午餐拖了一些時間，計劃沒趕上變化，匆匆出門、上捷運、轉機捷，踏上列車時已經 12:30。 雨點開始落在奔馳於高架橋上的捷運，辦好了登機，\b查好等等去機場該做什麼後，列車便駛進機場二航下。 行李托運、出海關意外的快速，我一直以為會是非常繁瑣而謹慎的過程，甚至不禁思索，要偷運毒品出國也太簡單了吧？ 到了支那，身為一個堂堂正正的中國人，回歸祖國當然是走國人通道 才剛出機場，一股酸味撲鼻而來，原來所謂祖國的汕液就是這個味道… 載我們去北航的，是一輛中型巴士，「中國有中國的玩法」馬上體現——巴士沒有置物架，大家的行李就這樣疊在走道上。 Beihang International Summor School 算是以國際學生為主的計畫，台港澳雖然有一定人數，但還是老外居多，也因為這樣，我們住的是北航在校園內經營的「飯店」，雖然以飯店來說有許多不足之處，但跟宿舍比已經是天差地遠了。 總之，平安抵達北航！","raw":null,"content":null,"categories":[],"tags":[{"name":"北航","slug":"北航","permalink":"https://blog.petingo.ch/tags/%E5%8C%97%E8%88%AA/"}]},{"title":"四疊半神話大系","slug":"The-Tatami-Galaxy","date":"2018-06-18T15:57:07.000Z","updated":"2021-11-13T09:20:38.295Z","comments":true,"path":"The-Tatami-Galaxy/","link":"","permalink":"https://blog.petingo.ch/The-Tatami-Galaxy/","excerpt":"\n看完最大的心得大概是「不要宅在家裡，多出去認識一些人」這樣吧。\b\n蠻幸運的在大學還沒結束前看了這部作品，也因此思考了很多人生。","text":"看完最大的心得大概是「不要宅在家裡，多出去認識一些人」這樣吧。\b 蠻幸運的在大學還沒結束前看了這部作品，也因此思考了很多人生。 誰該為此負責 不知道在萬隆貧民窟的時候有幾個夜深人靜的晚上，我們互相調侃對方新認識的女性朋友、互相檢討為什麼交不到女朋友，並同時抱怨沒有異性的生活圈、商討著早已講到爛掉的拓展方法。其實我們也都知道該試著加個社團、參加活動，但一想到要面對陌生人、想到之前的失敗經驗，就又會卻步。我一直覺得我處在一個狀態：知道問題在哪、大概知道解決方向、有點想嘗試、但總是果斷放棄。 但再想一想，誰不是呢？人終究是群體的動物，與人相處終究是一項重要的技能；我自認是個很好相處的人，但面對不熟悉的人、面對不知該開口說什麼的對象，總是有一層深深的恐懼，彷彿我是個走在鋼索上的表演者，路的一端是那位陌生人，而鋼索底下聚集著準備看好戲的人潮，等著我摔下去；所以我選擇待在原地，只要不跨出第一步，就不用面對進退兩難的窘境。 要是我們是三體人該有多好，直接就把意識攤在陽光底下，也不用怕開口了。上了大學以後最無法適應的大概就是這點了。 講到這裡又想到，高中男校女校真的是一種反人類的設計，把男女區隔開來的目的到底是什麼？套句朋友的話：「如果是因為怕談戀愛會影響成績，會談的還是會談，肥宅每天看動畫也是浪費一堆時間。」如果是怕不小心幹下去生小孩的那更好，台灣生育率那麼低順便可以救一救（沒有啦我相信大家都會乖乖戴套）。為了學習如何考試，反倒失去了許多學習和異性相處的機會，尤其是對我這種木訥又不會懂的怎麼人相處的人類，如果要想找個理由，這大概會是最好的怪罪。 請抓住就在你眼前的良機 太宰治在⟪人間失格⟫裡說過：「每個人講話的方式，都像這樣拐彎抹角、模稜兩可，彷彿為了規避責任而故意說的微妙而複雜…隱含在話中無謂的高度警戒，以及數不清的推拉策略，我從來都沒弄懂過。」 日本人最讓人敬畏三分的，大概就是這點吧。 我一直以來都認為，無論語言或是文字，其中心的本質就是要讓他人理解自己的所思所想；\b\b某方面來說我還蠻同意三體人的想法：人類必須透過語言才能傳遞想法是演化上的瑕疵。確實，透過語言有時無法完整的表達內心的想法，但同時也因為有語言、有心口不一的\b\b\b\b謊言，人類才得以生為人類，我們的生活與生命，也在其滋潤下變得不一樣。 或許這就是わたし一直與明石錯過的原因吧。 不討厭與喜歡、良機與良緣，猜不著的話中話就這樣一次次的在平行時空中錯開一段段戀情。 不過，緣分又是什麼呢？是姜太公釣魚的願者上鈎？是佛家超\b\b越現代科學的姻緣紅線？ 或許整個宇宙只是四次元生物創造的小小實驗室，人類只是其中的幾行程式碼、我們只是龐大演算法中的一個小小變數，我們的未來早已在宇宙誕生之時便已確立；但我還是寧願相信生命的走向操之在己，所謂「緣分」則是在人際關係中周旋以後，掌握在他人手上的變因。 溪裡釣不到黑鮪魚，四疊半宿舍裡也不會有明石。 走出悲劇的輪迴，需要勇氣，也只需要勇氣。 其他 上大學後好像養成了一個很不健康的壞習慣（或慣例？），就是期末考前一定會不小心補完一部動畫…。 這個端午連假也是過的很「充實」，開拓了兩間新餐廳、\bOOP 作業、重搞了 Web3 Provider Engine、為了看這部試用了百度雲盤的離線下載功能和各式各樣的下載加速器（不得不說對岸真的很狂，官方離線下載的教學文直接教你抓馬達加斯加的電影，完全視版權為無物；而且免費用戶下載 APP 就送 1T，綁信用卡再送 1T，要是 Google 也那麼大方，我的 Google Drive 就不會一直卡在 99% 跳警告了），這幾天的睡眠時間大概都是 3:00 - 12:00，今天更是 4:30 才上床，希望可以早點過上我所嚮往的健康生活。","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"},{"name":"動畫心得","slug":"動畫心得","permalink":"https://blog.petingo.ch/tags/%E5%8B%95%E7%95%AB%E5%BF%83%E5%BE%97/"}]},{"title":"想學程式，該學什麼語言","slug":"first-language-to-learn","date":"2018-06-08T17:19:28.000Z","updated":"2021-11-13T10:15:32.942Z","comments":true,"path":"first-language-to-learn/","link":"","permalink":"https://blog.petingo.ch/first-language-to-learn/","excerpt":"前幾天看到一個廣告「想學程式語言，但完全不懂？從…開始吧！」\n如果現在問我「想學程式，該學什麼語言」，我大概會不假思索地回答\n「英文」。","text":"前幾天看到一個廣告「想學程式語言，但完全不懂？從…開始吧！」 如果現在問我「想學程式，該學什麼語言」，我大概會不假思索地回答 「英文」。 不過我覺得在問「該學什麼語言」之前，應該要先回答「想學什麼樣的程式」；不同的程式語言本身就是因應不同應用場域而誕生的，是為了解決不同問題而被發明的。就好比今天你想鬆開一顆十字的螺絲釘，十字起跟一字起一樣都能辦到，但除非你有特殊的原因，你才會去用一字起，不然你轉一顆的時間，別人已經用十字起轉了好幾顆了。所以在決定要買一字起還是十字起前，應該要先確定你要轉開的是哪種螺絲釘。 回到英文。 前幾天在機場等著托運行李的時候，不經意的聽到這樣的對話： 「你知道全世界那個國家的外語水平最爛嗎？」 『嗯？』 「美國。」 「他們除了少數墨西哥邊境的人會講西班牙語，其他人基本上都只會講英文，不像歐洲至少都會三個語言。」 是啊，人家光會說英語就夠大吃四方了。還記得之前有個小學生寫 APP 寫到蘋果開發者大會上，無非就是靠著英文這樣一個巨大的優勢；不論是入門教學、技術文件、甚至是 Debugger 的 log，無一不需要英文；甚至把問題丟進 Google，stackoverflow 或是 github 上面的 issue 也幾乎都是英文。對比台灣的大學畢業生連 compiler 噴的 error 都看不懂，英語的重要性可見一斑。 這個世界上不知道有多少百分比的知識是用英文傳遞著。甚至我認為美國研發能力之所以強，一大原因是因為各領域的頂尖 paper 都是用英文寫的（當然美國錢多，吸引人才可能才是主要原因）。 當然也不是說英文不好就寫不了好程式，身在台灣會中文也是不錯，搭著支那 10 幾億人口的順風車，以及中共計畫性的將各式網路資源中文化，中文也越來越好用。 總之，英文真的重要。","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"}]},{"title":"const 放在 member function 的後面","slug":"const-at-the-end-of-member-function","date":"2018-06-01T02:36:31.000Z","updated":"2021-11-21T21:07:18.911Z","comments":true,"path":"const-at-the-end-of-member-function/","link":"","permalink":"https://blog.petingo.ch/const-at-the-end-of-member-function/","excerpt":" const 放前面與後面的意義\n\n放前面：代表回傳值是 const 的。\n\n1const int foo() &#123; &#125;\n\n放後面：僅出現在成員函數，代表函數不會改變呼叫者的值；目的是確保 const 的物件不會因為呼叫了某個 function 而變化。\n\n1int foo() const &#123; &#125;\n光文字敘述可能不太清楚，下面來舉栗子。","text":"const 放前面與後面的意義 放前面：代表回傳值是 const 的。 1const int foo() &#123; &#125; 放後面：僅出現在成員函數，代表函數不會改變呼叫者的值；目的是確保 const 的物件不會因為呼叫了某個 function 而變化。 1int foo() const &#123; &#125; 光文字敘述可能不太清楚，下面來舉栗子。 例子 我宣告了一個 class Dick ，裡面只有 int length 代表的長度。 因為ㄐㄐ會喵喵叫跟啪啪啪，所以另外有兩個 function meow(const Dick&amp; b) 和 fuck()，其中 meow 裡面的 const Dick&amp; b 會呼叫 fuck()。 先來試試看如果讓 const 的 b 呼叫非 const 的 fuck 會怎樣： 12345678910111213141516171819202122#include &lt;bits/stdc++.h&gt;using namespace std;class Dick &#123; int length; public: Dick(int length = 30) &#123; this-&gt;length = length; &#125; int meow(const Dick&amp; b) &#123; return fuck() + b.fuck(); // const 的 b call 了非 const 的 fuck() &#125; // 非 const 的 fuck() int fuck() &#123; return length + 5; &#125;&#125;;int main() &#123; Dick myDick, hisDick; cout &lt;&lt; myDick.meow(hisDick) &lt;&lt; endl;&#125; 編譯器馬上噴錯 123error: passing &#39;const Dick&#39; as &#39;this&#39; argument discards qualifiers [-fpermissive] int meow(const Dick&amp; b) &#123; return fuck() + b.fuck(); &#125; ^ 把 const 加上去： 12345678910111213141516171819202122#include &lt;bits/stdc++.h&gt;using namespace std;class Dick &#123; int length; public: Dick(int length = 30) &#123; this-&gt;length = length; &#125; int meow(const Dick&amp; b) &#123; return fuck() + b.fuck(); // const 的 b call 了 const 的 fuck() &#125; // const 的 fuck() int fuck() const &#123; return length + 5; &#125;&#125;;int main() &#123; Dick myDick, hisDick; cout &lt;&lt; myDick.meow(hisDick) &lt;&lt; endl;&#125; 恩，成功印出 70！ 再來試試看如果在一般的函數後面加上 const 會怎樣： 1int woof() const &#123; return 55555; &#125; 編譯器噴錯： 123error: non-member function &#39;int woof()&#39; cannot have cv-qualifierint woof() const &#123; return 55555; &#125; ^~~~~ 寫在後面 記得第一次遇到這個問題是為了要用 priority queue 而重載 operator&lt;()，必須讓它 const 否則會報錯。至於後來幾次應該都是為了傳 const reference 的參數進 function（也就是範例的形式）。 stackoverflow 上的這篇講的還蠻清楚的，但中文資源到底在供三小我是看沒有，於是寫了這篇，希望這樣夠直白明瞭。","raw":null,"content":null,"categories":[],"tags":[{"name":"資工","slug":"資工","permalink":"https://blog.petingo.ch/tags/%E8%B3%87%E5%B7%A5/"},{"name":"C++","slug":"C","permalink":"https://blog.petingo.ch/tags/C/"}]},{"title":"todoList.pop()","slug":"todoList-pop","date":"2018-05-25T18:27:18.000Z","updated":"2021-11-21T19:54:53.881Z","comments":true,"path":"todoList-pop/","link":"","permalink":"https://blog.petingo.ch/todoList-pop/","excerpt":"再一次把架部落格的想法付諸。\n原本以為應該是一下子就可以弄好的東西，但最後搞了差不多一個禮拜，目前應該算是接近完成，只剩下把自我介紹的部分補齊。\n至於為什麼會弄那麼久，大概是因為很好玩吧？這整個禮拜幾乎是廢寢忘食的地步（望向美妙的 OOP 期末專案）。","text":"再一次把架部落格的想法付諸。 原本以為應該是一下子就可以弄好的東西，但最後搞了差不多一個禮拜，目前應該算是接近完成，只剩下把自我介紹的部分補齊。 至於為什麼會弄那麼久，大概是因為很好玩吧？這整個禮拜幾乎是廢寢忘食的地步（望向美妙的 OOP 期末專案）。 hexo 心得 這次用了 hexo + apollo theme，期間也是坡折不斷。 第一天被瀏覽器 cache 雷，為了網頁 logo 搞了一天。 後來的幾天則是為了搞出 gallery 的頁面頭痛；先是 flickr API，再來是排版。 星期三下午趁著空閒，翻了一本 html5 + css + jQuery 的書；本想現學現賣，自己用 jQuery 把排版刻出來，但礙於能力太過低落了只好放棄，最後採用了 Unite Gallary，唯一的缺點大概是圖標 icon 解析度有點低，這部分先放進 Todo List 裡。 能把圖片排好以後，還有 hexo page layout 的設定，又是一番坡折，最後強行把建構相簿的 html + css + js 直接塞進自訂的 layout 檔裡面，姑且算是順利完成。 再來是把 tag 的功能加上去。 apollo 本身沒有 tag 和 category 的設定，但總覺得我會需要 tag 的功能，最後找到了這個 https://github.com/angelen10/hexo-theme-apollo 標籤雲的部分則是 https://github.com/MikeCoder/hexo-tag-cloud 接著花了一天把顏色調成喜歡的樣子、微調排版、寫好初步 About 的樣子，同時趁熱發了這篇心得。 最後 希望這次的熱度可以持續久一點（當然，前提是要有能寫的內容）。","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"},{"name":"部落格","slug":"部落格","permalink":"https://blog.petingo.ch/tags/%E9%83%A8%E8%90%BD%E6%A0%BC/"}]},{"title":"關於 Blog 這件事","slug":"about-blog","date":"2017-10-08T03:42:31.000Z","updated":"2021-11-13T09:20:38.746Z","comments":true,"path":"about-blog/","link":"","permalink":"https://blog.petingo.ch/about-blog/","excerpt":"從前就覺得應該花一點時間記錄下自己的生活。\n最初會有這個想法是看了學長 Morris 的部落格，從 OJ 解題到生活的心得，總覺得從中獲得了一些什麼。但應該要以 queue 完成的 Todo List 最後總變成 stack，越來越多的事情被拖著壓在箱底，然後再也沒有拿出來過。\nBlogger 比起那些早被夯實的願望，算是比較常探出頭的一個吧！總覺得這是一件很重要的小事。\n當初把 Blogger 開起來時留下的關於我是這樣寫的：\n「希望這個世界因為我的存在而變得更美好一些。」","text":"從前就覺得應該花一點時間記錄下自己的生活。 最初會有這個想法是看了學長 Morris 的部落格，從 OJ 解題到生活的心得，總覺得從中獲得了一些什麼。但應該要以 queue 完成的 Todo List 最後總變成 stack，越來越多的事情被拖著壓在箱底，然後再也沒有拿出來過。 Blogger 比起那些早被夯實的願望，算是比較常探出頭的一個吧！總覺得這是一件很重要的小事。 當初把 Blogger 開起來時留下的關於我是這樣寫的： 「希望這個世界因為我的存在而變得更美好一些。」 後來在 Jserv 的影片上聽到一段話：我們總希望能夠改變世界。改變世界其實很簡單，你躺著不動，降低呼吸的頻率就能夠改變整個世界的碳循環；你再放個屁就又改變了氮循環。改變世界其實很簡單，但我們希望的遠不是這個樣子。 考大學的時候，選系什麼的，完全不是問題，志願表填了六個資工，外加科大的兩個電資學士班。唯一考慮過非資工的科系是東海建築，但這個想法大概只持續了一個週末便作罷。從以前到現在，除了搞軟體，還有其他兩個還沒放棄的夢想，一個是小說家，另一個是街頭藝人。三者並不衝突，但時間卻是。（這篇文章從開始下筆到完成隔了快一個月，現在似乎又多了一個互動藝術創作呢！） 感覺許多時間被浪費在毫無意義的事情上；當然也不能說是毫無意義，畢竟生命中的每件事總會有它的價值，但總覺得那些瑣事像是夢想路上的旁枝末節，懷疑岔路走多了，是否能在日落前抵達夢想的盡頭？ 嘛，不過，不是每件事都應該追求最短路徑，人生嘛，到頭來都是過程，每個當下的自我都是過往經驗累積的人格，每一個夢想、每一段記憶都是這樣不斷改變的人格所創造，所謂的旁枝末節，也許才是康莊大道也說不定呢？ 只是總覺得生命一直有個目標，生活卻經常在徬徨。一直以來，記事本置頂著短期內應該要完成的事情清單，但往往像府城的紅綠燈一樣「好喔我看到現在亮著紅色的燈，還有綠色的往左箭頭，但是我想要右轉，因為外星人不會戴帽子。」大概是這樣，然後繼續把那塊 stack 擱著。 總之呢，希望可以藉著隨筆的過程紀錄下每一段最近，以免記憶沙灘上的足跡被時間的浪抹平，同時整理一下永遠不會完成的 Todo List。 也許某天，會有素味平生的某人偶然點開這些文字，如果能從中獲得一些勉勵或想法（或是決定開始寫 Blogger 之類的），那我想應該也算夢想一點小小的實踐吧！ – 從 Blogger 備份","raw":null,"content":null,"categories":[],"tags":[{"name":"一些想法","slug":"一些想法","permalink":"https://blog.petingo.ch/tags/%E4%B8%80%E4%BA%9B%E6%83%B3%E6%B3%95/"}]},{"title":"Android 複製其他 APP 在 /data/data/ 中的資料","slug":"Android-copy-other-apps-data","date":"2016-02-27T16:51:50.000Z","updated":"2021-11-21T19:55:50.071Z","comments":true,"path":"Android-copy-other-apps-data/","link":"","permalink":"https://blog.petingo.ch/Android-copy-other-apps-data/","excerpt":" 緣起\n最初會用到這玩意兒，是高中科展時為了要撈出 Line、Facebook messenger 的聊天訊息進行分析。當時為了這東西不知道搞了多久，最後還是靠隊友 Carry 才生出這份 code。\n後來做的神魔關卡備份外掛也是靠這它才得以順利完成，再謝謝一次神奇的小夥伴。\n 為什麼\nAndroid APP 在執行時會被限制在一個沙盒（sandbox）中，對於系統資源的存取會被隔離，大致如下圖所示；因此若要存取別的 APP 存放在 /data/data/ 中的資料，勢必得從其他地方下手。\n\n","text":"緣起 最初會用到這玩意兒，是高中科展時為了要撈出 Line、Facebook messenger 的聊天訊息進行分析。當時為了這東西不知道搞了多久，最後還是靠隊友 Carry 才生出這份 code。 後來做的神魔關卡備份外掛也是靠這它才得以順利完成，再謝謝一次神奇的小夥伴。 為什麼 Android APP 在執行時會被限制在一個沙盒（sandbox）中，對於系統資源的存取會被隔離，大致如下圖所示；因此若要存取別的 APP 存放在 /data/data/ 中的資料，勢必得從其他地方下手。 所以要怎麼做？ 複製貼上就可以了。 基本上就是先拿 Root 權限，然後執行 linux 的複製指令 1234567891011121314public static void copy(string resorsePath, string targetPath)&#123; Process suProcess = null; try &#123; suProcess = Runtime.getRuntime().exec(\"su\"); DataOutputStream os = new DataOutputStream(suProcess.getOutputStream()); os.writeBytes(\"mkdir -p \" + targetPath + \"\\n\"); os.writeBytes(\"cp -r \" + resorsePath + \" \" + targetPath + \"\\n\"); os.writeBytes(\"exit\\n\"); os.flush(); &#125; catch (IOException e) &#123; e.printStackTrace(); &#125;&#125; 收工！","raw":null,"content":null,"categories":[],"tags":[{"name":"Android","slug":"Android","permalink":"https://blog.petingo.ch/tags/Android/"},{"name":"資工","slug":"資工","permalink":"https://blog.petingo.ch/tags/%E8%B3%87%E5%B7%A5/"}]},{"title":"一些很有感觸的句子","slug":"heiku","date":"1998-07-13T16:00:00.000Z","updated":"2022-07-10T23:43:06.165Z","comments":true,"path":"heiku/","link":"","permalink":"https://blog.petingo.ch/heiku/","excerpt":"","text":"這裡放了一些我覺得讓我感觸很深的句子。 2022.07.10 出處：幹這根本有病#11 愛與拖稿 「…如果每個人的生活跟朋友都像影片中一樣有趣和瘋狂，那這個頻道大概就不會那麼有吸引力了，然而會喜歡這些影片的觀眾，應該有些人正過著有點乏味的日子（例如我），所以這些影片就不只是朋友間的生活紀錄，更像是一種無法得到卻又極度渴望的夢，雖然真的很高興發現這個頻道，但看完後回頭面對現實，會有種莫名的空虛感，有點像拎娘說的『永遠在追求得不到的東西』吧。」 ——Nancy Li 開始做這些紀錄大概是兩三年前，從大學畢業後（我25歲才畢業），算是剛進入社會的磨合階段。 其實在這幾年間多半的心情是焦慮且迷惘的，生活的慰藉也就是聽聽朋友生活中的故事，在週末晚上喝酒的聚會時。想把這些快樂的moment記錄下來，提醒自己一些什麼，也試著用這些片段來做一些剪接的嘗試與練習（我平常就是接剪接案為生的）。 不知道說這些對妳而言有沒有幫助，但我覺得紀錄的過程可以幫助釐清很多想法，更了解自己是如何看待自己當下的生活，什麼是重要/不重要的，有哪些應當珍惜卻沒能意識到的關係，以及自己究竟是如何理解身邊的緣分。 年初的時候有一位平時會出現在影片內的好友不幸過世了，這幾個月我花了很多時間不停重看有留下他身影的影片，對我而言幫助很大。 不知道要說些啥，但希望妳也能在生活中找到一些讓妳值得珍惜的人事物，至少我覺得這樣的東西對我而言是很重要的，在面對人生的不安時可以提供必須的安全感。 Anyway, wish you the best —— Andy’s iPhone 2020.05.08 人們害怕不平凡的事物。在平凡中出眾，在不凡裡普通。 —不詳 2019.09.09 「我们在蝇营狗苟的生活之中学到的是贪婪，而失去的正是个性，当我们在朝阳区或者浦东的昂贵写字楼里寻觅各种机会的时候，并不曾反省自己的日子是多么糟糕」 —佛祖在一号线／李海鹏 2019.04.10 「不是放棄夢想，只是習慣了自己的平庸而已」 —不詳 2018.05.27 「與其看著那些無法改變的懊悔，不如藉著痛苦的失去成長。」 —不詳 2017.12.06 「看著別人對於夢想的堅持、選擇之路上的所失所獲，不禁感嘆自己的付出相對而言是多麼的微不足道。看著英雄拾起寶劍在戰場廝殺，回頭看看過往的自己，仿佛揮舞著玩具槍、嚷著要征服世界的小屁孩。 我想，所謂的人生就是不斷的用時間與世界交易；用時間換學識、用時間換金錢，有些人善於投資理財，有些人敢把籌碼壓在高賠率的地方，就這樣，每個人有了不同的價值。 想成為不凡的人，卻天天做著平凡的事，那就不要抱怨天不時地不利。」 —不詳","raw":null,"content":null,"categories":[],"tags":[]}]}